<?php
/**
 * Created by PhpStorm.
 * User: babenoff
 * Date: 09.12.2015
 * Time: 21:50
 */

$lang = [
    "class" => [
        "war" => "воин",
        "mag" => "маг",
        "ass" => "убийца"
    ],
    "spl" => [
        "war_sword_shield"  => "страж",
        "war_dual_sword"    => "воин",
        "war_mace"          => "палладин",
        "war_spear"         => "рыцарь",
        "war_axe"           => "берсерк"
    ],
    "char_params" => [
        "жизнь", "макс. жизнь", "мана", "макс. мана"
    ],
    "base_params" => [
        "сила", "ловкость", "интеллект", "конституция", "выносливость", "харизма"
    ],
    "war_skills" => [
        "рукопашный бой", "мечи"
    ],
    "info" => [
        "base_params" => [
            "Влияет на силу нанесенного вами удара. Чем выше сила, тем больше урона вы нанесете.",
            "Пожалуй, самый универсальный параметр. Влияет на уворот, точность удара, шанс нанесения критического удара, скорость персонажа.",
            "Влияет на уровень маны, а также на шанс удачного произнесения заклинания.",
            "Показатель влияет на уровень здоровья персонажа и уклон, 1 вложенное очко дает 10 единиц жизни и отнимает 0.5% уклона. ",
            "Влияет на скорость восстановления вашего здоровья. При уровне выносливости 60 вы восстанавливаете 1 единицу здоровья в секунду.",
            "Влияет на уровень маны, а также на скорость ее восстановления. При уровне харизмы 60 вы восстанавливаете 1 единицу маны в секунду."
        ]
    ],
];