<?php
/**
 * Created by PhpStorm.
 * User: babenoff
 * Date: 03.12.2015
 * Time: 16:40
 */

return [
    "i.m.money" => [
        "titles" => [
            "nom" => "серебро",
            "gen" => "серебра",
            "dat" => "серебру",
            "acc" => "серебро",
            "inst" => "серебром",
            "prep" => "о серебре",
            "plural" => "серебра"
        ],
        "info" => "Серебрянные монеты, за них можно что-нибудь купить у торговцев"
    ],

    "i.a.bnov" => [
        "titles" => [
            "nom" => "рубуха новобранца",
            "gen" => "рубаху новобранца",
            "dat" => "рубахе новобранца",
            "acc" => "рубаху новобраца",
            "inst" => "рубахой новобранца",
            "prep" => "о рубахе новобранца",
            "plural" => "рубахи новобранца"
        ],
        "info" => "Немного потрепаная рубашка, но все равно имеет довольно приличный вид."
    ],

    "i.a.lnov" => [
        "titles" => [
            "nom" => "штаны новобранца",
            "gen" => "штанов новобранца",
            "dat" => "штанам новобранца",
            "acc" => "штаны новобраца",
            "inst" => "штанами новобранца",
            "prep" => "о штанах новобранца",
            "plural" => "штаны новобранца"
        ],
        "info" => "Немного потрепаные штаны, но все равно имеет довольно приличный вид."
    ],

    "i.a.snov" => [
        "titles" => [
            "nom" => "сапоги новобранца",
            "gen" => "сапогов новобранца",
            "dat" => "сапогам новобранца",
            "acc" => "сапоги новобраца",
            "inst" => "сапогами новобранца",
            "prep" => "о сапогах новобранца",
            "plural" => "сапоги новобранца"
        ],
        "info" => "Немного потрепаная рубашка, но все равно имеет довольно приличный вид."
    ],

];