<?php
/**
 * Created by PhpStorm.
 * User: babenoff
 * Date: 03.12.2015
 * Time: 19:45
 */

return [
    "stats_base" =>[
        "сила",
        "ловкость",
        "интеллект",
        "регенерация",
        "медитация",
		"конституция"
    ],
    "war_stats" => [
        "точность",
        "мин. урон",
        "макс. урон",
        "скорость атаки",
        "броня",
        "уклон",
        "парирование",
        "маг. точность",
        "маг. уклон",
        "маг. рассеивание",
        "маг. парирование",
        "физ. крит.",
        "маг. крит"
    ],
	"war_passive_skills" => [
		"рукопашный бой",
		"владение мечами",
		"владение магией",
		"владение кинжалами",
		"владение луками",
		"владение посохами",
		"владение топорами",
		"владение дубинами",
		"уклонение",
		"парирование",
		"маг. уклонение",
		"маг. парирование",
	]; 
	
	"war_active_skills" => [
	
	];
];